applications/py-FSI/referenceCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          230;
        startFace       21876;
    }
    outlet
    {
        type            patch;
        nFaces          96;
        startFace       22106;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          82;
        startFace       22202;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          22080;
        startFace       22284;
    }
)

// ************************************************************************* //
